
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |   🔴 Destroy |
|----------:|---------:|----------:|-------------:|
|        ✅ |       42 |         0 |           42 |
## Affected resources by action


<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-20 14:48:39 +0000 UTC" -> (known after apply)
      ~ id              = "github-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-20 14:48:39 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:23 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:23 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:27 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-289256138624:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:27 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:28 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-303467602807:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:28 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-09 16:11:13 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-493370826424:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-09 16:11:13 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:10 +0000 UTC" -> (known after apply)
      ~ id              = "cookiecutter-github-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:10 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["hiera-aws-sm"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-05-18 16:13:34 +0000 UTC" -> (known after apply)
      ~ id              = "hiera-aws-sm:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-05-18 16:13:34 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["homebrew-infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-03-29 16:42:34 +0000 UTC" -> (known after apply)
      ~ id              = "homebrew-infrahouse-toolkit:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-29 16:42:34 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-19 20:36:21 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-com:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-19 20:36:21 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["infrahouse-puppet-data"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-08 13:02:45 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-puppet-data:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-08 13:02:45 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:01 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-toolkit:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:01 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:02 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-website-infra:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:02 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-15 14:57:57 +0000 UTC" -> (known after apply)
      ~ id              = "proxysql-sandbox:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-15 14:57:57 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-03 15:39:14 +0000 UTC" -> (known after apply)
      ~ id              = "puppet-code:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-03 15:39:14 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-actions-runner"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-04-10 15:17:29 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-actions-runner:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-04-10 15:17:29 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-aerospike"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-03-16 01:08:18 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-aerospike:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-16 01:08:18 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-bookstack"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-05-19 15:00:34 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-bookstack:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-05-19 15:00:34 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-18 00:29:33 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-ci-cd:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-18 00:29:33 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-18 15:43:43 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-cloud-init:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-18 15:43:43 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-24 23:33:38 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-debian-repo:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-24 23:33:38 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ecs"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-23 16:01:51 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-ecs:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-23 16:01:51 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-elasticsearch"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-02-05 17:31:01 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-elasticsearch:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-05 17:31:01 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-03 23:05:00 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-gh-identity-provider:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-03 23:05:00 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-02 15:15:28 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-gha-admin:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-02 15:15:28 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-backup"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-10-08 19:45:33 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-github-backup:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-10-08 19:45:33 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-backup-configuration"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-10-09 13:13:54 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-github-backup-configuration:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-10-09 13:13:54 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-role"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-07 23:09:44 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-github-role:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-07 23:09:44 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-10 15:10:07 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-instance-profile:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-10 15:10:07 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-jumphost"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-01 16:16:00 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-jumphost:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-01 16:16:00 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-kibana"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-02-18 02:11:56 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-kibana:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-18 02:11:56 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-openvpn"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-06-25 23:41:55 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-openvpn:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-06-25 23:41:55 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-postfix"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-03-21 17:45:33 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-postfix:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-21 17:45:33 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-pypiserver"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-02-20 20:53:05 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-pypiserver:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-20 20:53:05 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-secret"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-05-28 19:09:40 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-secret:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-05-28 19:09:40 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-secret-policy"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-06-13 00:40:28 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-secret-policy:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-06-13 00:40:28 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-18 03:57:27 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-service-network:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-18 03:57:27 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-15 14:59:48 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-state-bucket:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-15 14:59:48 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-09 22:25:46 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-state-manager:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-09 22:25:46 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-tags-override"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-03-14 01:40:51 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-tags-override:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-14 01:40:51 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-terraformer"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-03-19 16:47:49 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-terraformer:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-19 16:47:49 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-update-dns"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-02-12 22:51:30 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-update-dns:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-12 22:51:30 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-13 19:44:21 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-website-pod:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-13 19:44:21 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 42 to add, 0 to change, 42 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogNDIsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDQyfX0=
```
</details>